Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Added guided adding of translation components with automatic detection of translation files.
sv: Lagt till guidad tillÃ¤gg av Ã¶versÃ¤ttningskomponenter med automatisk detektering av Ã¶versÃ¤ttningsfiler.

source: Customizable merge commit messages for Git.
sv: Anpassningsbara sammanfogningsmeddelanden fÃ¶r Git.

source: Added visual indication of component alerts in navigation.
sv: Lagt till visuell indikation av komponentvarningar i navigeringen.

source: Improved performance of loading translation files.
sv: FÃ¶rbÃ¤ttrad prestanda vid laddning av Ã¶versÃ¤ttningsfiler.

source: New add-on to squash commits prior to push.
sv: Nytt tillÃ¤gg fÃ¶r att krossa Ã¥taganden fÃ¶re push.

source: Improved displaying of translation changes.
sv: FÃ¶rbÃ¤ttrad visning av Ã¶versÃ¤ttningsÃ¤ndringar.

source: Changed default merge style to rebase and made that configurable.
sv: Ãndrade standardinstÃ¤llningen fÃ¶r sammanfogning till rebase och gjorde den konfigurerbar.

source: Better handle private use subtags in language code.
sv: Hantera subtags fÃ¶r privat anvÃ¤ndning bÃ¤ttre i sprÃ¥kkoden.

source: Improved performance of fulltext index updates.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r uppdateringar av fulltextindex.

source: Extended file upload API to support more parameters.
sv: UtÃ¶kad API fÃ¶r filuppladdning fÃ¶r att stÃ¶dja fler parametrar.

source: *Released on November 30th 2018.*
sv: *SlÃ¤pptes den 30 november 2018.*

source: Added support for component and project removal.
sv: Lagt till stÃ¶d fÃ¶r borttagning av komponenter och projekt.

source: Improved performance for some monolingual translations.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r vissa ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: Added translation component alerts to highlight problems with a translation.
sv: Lagt till Ã¶versÃ¤ttningskomponentvarningar fÃ¶r att markera problem med en Ã¶versÃ¤ttning.

source: Expose XLIFF string ``resname`` as context when available.
sv: Exponera XLIFF-strÃ¤ngen ``resname`` som kontext nÃ¤r den Ã¤r tillgÃ¤nglig.

source: Added support for XLIFF states.
sv: StÃ¶d fÃ¶r XLIFF-tillstÃ¥nd har lagts till.

source: Added check for non writable files in DATA_DIR.
sv: Lagt till kontroll av icke skrivbara filer i DATA_DIR.

source: Improved CSV export for changes.
sv: FÃ¶rbÃ¤ttrad CSV-export fÃ¶r Ã¤ndringar.

source: *Released on October 20th 2018.*
sv: *SlÃ¤pptes den 20 oktober 2018.*

source: Remove no longer needed Babel dependency.
sv: Ta bort Babel-beroendet som inte lÃ¤ngre behÃ¶vs.

source: Updated language definitions.
sv: Uppdaterade sprÃ¥kreferenser.

source: Improve documentation for add-ons, LDAP and Celery.
sv: FÃ¶rbÃ¤ttra dokumentationen fÃ¶r tillÃ¤gg, LDAP och Celery.

source: Fixed enabling new dos-eol and auto-java-messageformat flags.
sv: Fixade aktivering av nya flaggor dos-eol och auto-java-messageformat.

source: Fixed running setup.py test from PyPI package.
sv: Fixat kÃ¶rning av setup.py-test frÃ¥n PyPI-paketet.

source: Improved plurals handling.
sv: FÃ¶rbÃ¤ttrad hantering av pluralformer.

source: Fixed translation upload API failure in some corner cases.
sv: Ã tgÃ¤rdat fel vid uppladdning av Ã¶versÃ¤ttningar via API i vissa sÃ¤llsynta fall.

source: Fixed updating Git configuration in case it was changed manually.
sv: Fixade uppdateringen av Git-konfigurationen i fall den Ã¤ndrats manuellt.

source: *Released on October 10th 2018.*
sv: *SlÃ¤pptes den 10 oktober 2018.*

source: Document dependency on backports.csv on Python 2.7.
sv: Dokumentberoende pÃ¥ backports.csv i Python 2.7.

source: Fix running tests under root.
sv: Fixa kÃ¶rning av tester under root.

source: Improved error handling in gitexport module.
sv: FÃ¶rbÃ¤ttrad felhantering i gitexport-modulen.

source: Fixed progress reporting for newly added languages.
sv: FaststÃ¤lld framstegsrapportering fÃ¶r nyinfÃ¶rda sprÃ¥k.

source: Correctly report Celery worker errors to Sentry.
sv: Rapportera fel i Celery Worker korrekt till Sentry.

source: Fixed creating new translations with Qt Linguist.
sv: Fixat skapandet av nya Ã¶versÃ¤ttningar med Qt Linguist.

source: Fixed occasional fulltext index update failures.
sv: Ã tgÃ¤rdade tillfÃ¤lliga fel vid uppdatering av fulltextindex.

source: Improved validation when creating new components.
sv: FÃ¶rbÃ¤ttrad validering vid skapande av nya komponenter.

source: Added support for cleanup of old suggestions.
sv: Lagt till stÃ¶d fÃ¶r rensning av gamla fÃ¶rslag.

source: *Released on October 6th 2018.*
sv: *SlÃ¤pptes den 6 oktober 2018.*

source: Add install_addon management command for automated add-on installation.
sv: LÃ¤gg till kommandot install_addon fÃ¶r automatisk installation av tillÃ¤gg.

source: Allow more fine grained :ref:`rate-limit` settings.
sv: TillÃ¥t mer detaljerade :ref:`rate-limit`-instÃ¤llningar.

source: Added support for export and import of Excel files.
sv: StÃ¶d fÃ¶r export och import av Excel-filer har lagts till.

source: Improve component cleanup in case of multiple component discovery add-ons.
sv: FÃ¶rbÃ¤ttra komponentrensningen vid flera tillÃ¤gg fÃ¶r komponentupptÃ¤ckt.

source: Rewritten Microsoft Terminology machine translation backend.
sv: Omskriven Microsoft Terminology-maskinÃ¶versÃ¤ttningsbackend.

source: Weblate now uses Celery to offload some processing.
sv: Weblate anvÃ¤nder nu Celery fÃ¶r att avlasta en del av bearbetningen.

source: Improved search capabilities and added regular expression search.
sv: FÃ¶rbÃ¤ttrade sÃ¶kfunktioner och tillagd sÃ¶kning med reguljÃ¤ra uttryck.

source: Added support for Youdao Zhiyun API machine translation.
sv: StÃ¶d fÃ¶r maskinÃ¶versÃ¤ttning med Youdao Zhiyun API har lagts till.

source: Added support for Baidu API machine translation.
sv: StÃ¶d fÃ¶r maskinÃ¶versÃ¤ttning med Baidu API har lagts till.

source: Integrated maintenance and cleanup tasks using Celery.
sv: Integrerade underhÃ¥lls- och rengÃ¶ringsuppgifter med Celery.

source: Improved performance of loading translations by almost 25%.
sv: FÃ¶rbÃ¤ttrad prestanda vid laddning av Ã¶versÃ¤ttningar med nÃ¤stan 25 %.

source: Removed support for merging headers on upload.
sv: StÃ¶d fÃ¶r att slÃ¥ samman rubriker vid uppladdning har tagits bort.

source: Removed support for custom commit messages.
sv: StÃ¶d fÃ¶r anpassade commit-meddelanden har tagits bort.

source: Configurable editing mode (zen/full).
sv: Konfigurerbart redigeringslÃ¤ge (zen/full).

source: Added support for error reporting to Sentry.
sv: Lagt till stÃ¶d fÃ¶r felrapportering till Sentry.

source: Added support for automated daily update of repositories.
sv: Lagt till stÃ¶d fÃ¶r automatisk daglig uppdatering av arkiv.

source: Added support for creating projects and components by users.
sv: Lagt till stÃ¶d fÃ¶r att skapa projekt och komponenter av anvÃ¤ndare.

source: Built-in translation memory now automatically stores translations done.
sv: Det inbyggda Ã¶versÃ¤ttningsminnet lagrar nu automatiskt utfÃ¶rda Ã¶versÃ¤ttningar.

source: Users and projects can import their existing translation memories.
sv: AnvÃ¤ndare och projekt kan importera sina befintliga Ã¶versÃ¤ttningsminnen.

source: Better management of related strings for screenshots.
sv: BÃ¤ttre hantering av relaterade strÃ¤ngar fÃ¶r skÃ¤rmdumpar.

source: Added support for checking Java MessageFormat.
sv: Lagt till stÃ¶d fÃ¶r kontroll av Java MessageFormat.

source: See `3.2 milestone on GitHub <https://github.com/WeblateOrg/weblate/milestone/36?closed=1>`_ for detailed list of addressed issues.
sv: Se `3.2 milestone pÃ¥ GitHub <https://github.com/WeblateOrg/weblate/milestone/36?closed=1>`_ fÃ¶r en detaljerad lista Ã¶ver Ã¥tgÃ¤rdade problem.

source: *Released on July 27th 2018.*
sv: *SlÃ¤pptes den 27 juli 2018.*

source: Fix testsuite failure on some setups.
sv: Ã tgÃ¤rda testsuite-fel pÃ¥ vissa installationer.

source: Upgrades from older version than 3.0.1 are not supported.
sv: Uppgraderingar frÃ¥n Ã¤ldre versioner Ã¤n 3.0.1 stÃ¶ds inte.

source: Allow to override default commit messages from settings.
sv: TillÃ¥t att Ã¥sidosÃ¤tta standardmeddelanden fÃ¶r bekrÃ¤ftelse frÃ¥n instÃ¤llningarna.

source: Improve webhooks compatibility with self hosted environments.
sv: FÃ¶rbÃ¤ttra webhooks kompatibilitet med sjÃ¤lvhostade miljÃ¶er.

source: Added support for Amazon Translate.
sv: StÃ¶d fÃ¶r Amazon Translate har lagts till.

source: Compatibility with Django 2.1.
sv: Kompatibilitet med Django 2.1.

source: Django system checks are now used to diagnose problems with installation.
sv: Django-systemkontroller anvÃ¤nds nu fÃ¶r att diagnostisera problem med installationen.

source: Removed support for soon shutdown libravatar service.
sv: StÃ¶d fÃ¶r libravatar-tjÃ¤nsten, som snart kommer att stÃ¤ngas ned, har tagits bort.

source: New add-on to mark unchanged translations as needing edit.
sv: Nytt tillÃ¤gg fÃ¶r att markera ofÃ¶rÃ¤ndrade Ã¶versÃ¤ttningar som behÃ¶ver redigeras.

source: Add support for jumping to specific location while translating.
sv: LÃ¤gg till stÃ¶d fÃ¶r att hoppa till en specifik plats under Ã¶versÃ¤ttningen.

source: Downloaded translations can now be customized.
sv: Nedladdade Ã¶versÃ¤ttningar kan nu anpassas.

source: Improved calculation of string similarity in translation memory matches.
sv: FÃ¶rbÃ¤ttrad berÃ¤kning av strÃ¤nglikhet i Ã¶versÃ¤ttningsminnesmatchningar.

source: Added support by signing Git commits by GnuPG.
sv: Lagt till stÃ¶d genom att signera Git-commits med GnuPG.

source: *Released on June 10th 2018.*
sv: *SlÃ¤pptes den 10 juni 2018.*

source: Fixed possible migration issue from 2.20.
sv: RÃ¤ttat mÃ¶jligt migreringsproblem frÃ¥n 2.20.

source: Removed obsolete hook examples.
sv: FÃ¶rÃ¥ldrade hook-exempel har tagits bort.

source: Improved caching documentation.
sv: FÃ¶rbÃ¤ttrad dokumentation om caching.

source: Fixed displaying of admin documentation.
sv: Fast visning av administratÃ¶rsdokumentation.

source: Improved handling of long language names.
sv: FÃ¶rbÃ¤ttrad hantering av lÃ¥nga sprÃ¥knamn.

source: *Released on June 1st 2018.*
sv: *SlÃ¤pptes den 1 juni 2018.*

source: Rewritten access control.
sv: Omskriven Ã¥tkomstkontroll.

source: Several code cleanups that lead to moved and renamed modules.
sv: Flera kodrensningar som leder till flyttade och omdÃ¶pta moduler.

source: New add-on for automatic component discovery.
sv: Nytt tillÃ¤gg fÃ¶r automatisk komponentupptÃ¤ckt.

source: The import_project management command has now slightly different parameters.
sv: Kommandot import_project management har nu nÃ¥got annorlunda parametrar.

source: Added basic support for Windows RC files.
sv: Lagt till grundlÃ¤ggande stÃ¶d fÃ¶r Windows RC-filer.

source: New add-on to store contributor names in PO file headers.
sv: Nytt tillÃ¤gg fÃ¶r att lagra bidragsgivarnas namn i PO-filens rubriker.

source: The per component hook scripts are removed, use add-ons instead.
sv: Hook-skripten per komponent har tagits bort. AnvÃ¤nd istÃ¤llet tillÃ¤gg.

source: Add support for collecting contributor agreements.
sv: LÃ¤gg till stÃ¶d fÃ¶r insamling av bidragsgivaravtal.

source: Access control changes are now tracked in history.
sv: Ãndringar i Ã¥tkomstkontrollen spÃ¥ras nu i historiken.

source: New add-on to ensure all components in a project have same translations.
sv: Nytt tillÃ¤gg fÃ¶r att sÃ¤kerstÃ¤lla att alla komponenter i ett projekt har samma Ã¶versÃ¤ttningar.

source: Support for more variables in commit message templates.
sv: StÃ¶d fÃ¶r fler variabler i mallar fÃ¶r commit-meddelanden.

source: Add support for providing additional textual context.
sv: LÃ¤gg till stÃ¶d fÃ¶r att tillhandahÃ¥lla ytterligare textuell kontext.

source: Weblate 4.x series
sv: Weblate 4.x-serien

source: *Released on June 30th 2023.*
sv: *SlÃ¤pptes den 30 juni 2023.*

source: Fixed parsing notes from TBX.
sv: Fixade parsningsanteckningar frÃ¥n TBX.

source: Fixed query parsing in navigation bar search.
sv: Fixat problem med tolkning av sÃ¶kfrÃ¥gor i navigeringsfÃ¤ltets sÃ¶kfunktion.

source: Fixed language filtering in reports.
sv: Fast sprÃ¥kfiltrering i rapporter.

source: Improved ModernMT languages mapping.
sv: FÃ¶rbÃ¤ttrad ModernMT-sprÃ¥kkartlÃ¤ggning.

source: Disabled reused checks on languages with a single plural form.
sv: Inaktiverade Ã¥teranvÃ¤nda kontroller fÃ¶r sprÃ¥k med en enda pluralform.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/102?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/102?closed=1>`__.

source: *Released on June 16th 2023.*
sv: *SlÃ¤pptes den 16 juni 2023.*

source: Fixed language code format for i18next.
sv: Fast sprÃ¥k kodformat fÃ¶r i18next.

source: Fixed CSS compression with dark theme.
sv: Fixad CSS-komprimering med mÃ¶rkt tema.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/101?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/101?closed=1>`__.

source: *Released on June 15th 2023.*
sv: *SlÃ¤pptes den 15 juni 2023.*

source: Improved API error messages on permission denied.
sv: FÃ¶rbÃ¤ttrade API-felmeddelanden vid nekad behÃ¶righet.

source: Reduced false positives of the XML checks.
sv: Minskat antal falska positiva resultat vid XML-kontroller.

source: Translated check accuracy has been improved.
sv: ÃversÃ¤ttningsnoggrannheten har fÃ¶rbÃ¤ttrats.

source: Extended support for Fluent file format.
sv: UtÃ¶kat stÃ¶d fÃ¶r Fluent-filformat.

source: Avoiding signing-out user in some rate-limits.
sv: Undvika att logga ut anvÃ¤ndare i vissa hastighetsbegrÃ¤nsningar.

source: Added support for storing glossary explanation in TBX format.
sv: Lagt till stÃ¶d fÃ¶r lagring av ordfÃ¶rklaringar i TBX-format.

source: Added support for ordering strings by last update.
sv: Lagt till stÃ¶d fÃ¶r att sortera strÃ¤ngar efter senaste uppdatering.

source: Extended search capabilities for finding users.
sv: UtÃ¶kade sÃ¶kfunktioner fÃ¶r att hitta anvÃ¤ndare.

source: Support for automatic update of screenshots from a repository.
sv: StÃ¶d fÃ¶r automatisk uppdatering av skÃ¤rmdumpar frÃ¥n ett arkiv.

source: Improved translation memory performance.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r Ã¶versÃ¤ttningsminnet.

source: Project stats exports to JSON/CSV now include more details; it now matches content available in the API.
sv: Projektsstatistik som exporteras till JSON/CSV innehÃ¥ller nu mer detaljerad information och matchar nu innehÃ¥llet som finns tillgÃ¤ngligt i API:et.

source: Added check for reused translation.
sv: Lagt till kontroll fÃ¶r Ã¥teranvÃ¤nd Ã¶versÃ¤ttning.

source: Highlight suggested change in automatic suggestions.
sv: Markera fÃ¶reslagna Ã¤ndringar i automatiska fÃ¶rslag.

source: Added dark theme; browser-following and manual setting are available.
sv: MÃ¶rkt tema har lagts till; webblÃ¤sarbaserad och manuell instÃ¤llning Ã¤r tillgÃ¤ngliga.

source: The Docker container can now be used with read-only root filesystem.
sv: Docker-containern kan nu anvÃ¤ndas med ett skrivskyddat rotsystem.

source: Added username autocompletion when adding users to a project.
sv: Lagt till automatisk komplettering av anvÃ¤ndarnamn nÃ¤r anvÃ¤ndare lÃ¤ggs till i ett projekt.

source: Added site-wide search for projects, components, languages and users.
sv: Lagt till sÃ¶kfunktion fÃ¶r hela webbplatsen fÃ¶r projekt, komponenter, sprÃ¥k och anvÃ¤ndare.

source: New add-on Fill read-only strings with source.
sv: Nytt tillÃ¤gg Fyll skrivskyddade strÃ¤ngar med kÃ¤llkod.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/97?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/97?closed=1>`__.

source: Dropped support for PostgreSQL 10, 11, MySQL 5.7 and MariaDB 10.2, 10.3.
sv: StÃ¶det fÃ¶r PostgreSQL 10, 11, MySQL 5.7 och MariaDB 10.2, 10.3 har upphÃ¶rt.

source: Dropped support for Python 3.7.
sv: StÃ¶det fÃ¶r Python 3.7 har upphÃ¶rt.

source: The :ref:`fluent` format changed identification of some strings, you might need to force reloading of the translation files to see the changes.
sv: Formatet :ref:`fluent` har Ã¤ndrat identifieringen av vissa strÃ¤ngar. Du kan behÃ¶va tvinga omladdning av Ã¶versÃ¤ttningsfilerna fÃ¶r att se Ã¤ndringarna.

source: There are several changes in :file:`settings_example.py`, most notable is change in ``COMPRESS_OFFLINE_CONTEXT``, please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, den mest anmÃ¤rkningsvÃ¤rda Ã¤r Ã¤ndringen i ``COMPRESS_OFFLINE_CONTEXT``. Justera dina instÃ¤llningar dÃ¤refter.

source: *Released on April 17th 2023.*
sv: *SlÃ¤pptes den 17 april 2023.*

source: Allow to filter on language in reports.
sv: TillÃ¥t filtrering efter sprÃ¥k i rapporter.

source: Dropped deprecated command ``cleanup_celery``.
sv: Borttaget fÃ¶rÃ¥ldrat kommando ``cleanup_celery``.

source: Fixed private project visibility for some teams.
sv: FaststÃ¤lld privat projektvisibilitet fÃ¶r vissa team.

source: Automatic translation now honors target state when translating from other components.
sv: Automatisk Ã¶versÃ¤ttning respekterar nu mÃ¥ltillstÃ¥ndet vid Ã¶versÃ¤ttning frÃ¥n andra komponenter.

source: Improved performance of public user profiles.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r offentliga anvÃ¤ndarprofiler.

source: Improved Sentry performance monitoring integration.
sv: FÃ¶rbÃ¤ttrad integration av Sentry-prestandaÃ¶vervakning.

source: Added support for Ed25519 SSH key.
sv: StÃ¶d fÃ¶r Ed25519 SSH-nyckel har lagts till.

source: Rewritten metrics storage.
sv: Omskriven lagring av mÃ¤tvÃ¤rden.

source: Added support for searching strings by position.
sv: Lagt till stÃ¶d fÃ¶r sÃ¶kning av strÃ¤ngar efter position.

source: Unchanged translation check can honor untranslatable terms from glossary.
sv: OfÃ¶rÃ¤ndrad Ã¶versÃ¤ttningskontroll kan respektera icke Ã¶versÃ¤ttningsbara termer frÃ¥n ordlistan.

source: Added automatic fixup for Devanagari danda.
sv: Automatisk korrigering fÃ¶r Devanagari danda har lagts till.

source: Allow downloading project translation memory per language.
sv: TillÃ¥t nedladdning av projektets Ã¶versÃ¤ttningsminne per sprÃ¥k.

source: Added new alert on unused components.
sv: Lagt till ny varning om oanvÃ¤nda komponenter.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/93?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/93?closed=1>`__.

source: Migration to rewritten metrics storage might take considerable time on larger Weblate instance (expect around 15 minutes per GB of ``metrics_metric`` table). To reduce downtime, you can copy :file:`weblate/metrics/migrations/*.py` from Weblate 4.17 to 4.16 and start the migration in the background. Once it is completed, perform full upgrade as usual.
sv: Migrering till omskriven lagring av mÃ¤tvÃ¤rden kan ta avsevÃ¤rd tid pÃ¥ stÃ¶rre Weblate-instanser (rÃ¤kna med cirka 15 minuter per GB i tabellen ``metrics_metric``). FÃ¶r att minska driftstoppet kan du kopiera :file:`weblate/metrics/migrations/*.py` frÃ¥n Weblate 4.17 till 4.16 och starta migreringen i bakgrunden. NÃ¤r den Ã¤r klar utfÃ¶r du en fullstÃ¤ndig uppgradering som vanligt.

source: Docker container now requires PostgreSQL 12 or newer, please see :ref:`docker-postgres-upgrade` for upgrade instructions. Weblate itself supports older versions as well, when appropriate Django version is installed.
sv: Docker-containern krÃ¤ver nu PostgreSQL 12 eller nyare. Se :ref:`docker-postgres-upgrade` fÃ¶r uppgraderingsinstruktioner. Weblate stÃ¶der Ã¤ven Ã¤ldre versioner, fÃ¶rutsatt att rÃ¤tt version av Django Ã¤r installerad.

source: Migration on MySQL will try to load all metrics into memory due to limitation of the Python database driver. You might need to prune metrics prior to migration if you want to continue using MySQL. Please consider switching to PostgreSQL, see :ref:`database-migration`.
sv: Migration pÃ¥ MySQL kommer att fÃ¶rsÃ¶ka ladda alla mÃ¤tvÃ¤rden i minnet pÃ¥ grund av begrÃ¤nsningar i Python-databasdrivrutinen. Du kan behÃ¶va rensa mÃ¤tvÃ¤rden fÃ¶re migrationen om du vill fortsÃ¤tta anvÃ¤nda MySQL. ÃvervÃ¤g att byta till PostgreSQL, se :ref:`database-migration`.

source: *Released on March 16th 2023.*
sv: *SlÃ¤pptes den 16 mars 2023.*

source: Dependencies updates.
sv: Uppdateringar av beroenden.

source: Improved background tasks scheduling.
sv: FÃ¶rbÃ¤ttrad schemalÃ¤ggning av bakgrundsuppgifter.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/96?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/96?closed=1>`__.

source: *Released on March 15th 2023.*
sv: *SlÃ¤pptes den 15 mars 2023.*

source: Improved session handling with project backups.
sv: FÃ¶rbÃ¤ttrad hantering av sessioner med projektbackuper.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/95?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/95?closed=1>`__.

source: *Released on March 8th 2023.*
sv: *SlÃ¤pptes den 8 mars 2023.*

source: Fixed searching in the translation memory.
sv: Fast sÃ¶kning i Ã¶versÃ¤ttningsminnet.

source: Fixed automatic translation with more services.
sv: Fast automatisk Ã¶versÃ¤ttning med fler tjÃ¤nster.

source: Improved rendering of overlapping glossary term matches.
sv: FÃ¶rbÃ¤ttrad Ã¥tergivning av Ã¶verlappande ordlistetermer.

source: Fixed plurals parsing for non-English source language in some formats.
sv: Fixat pluralanalys fÃ¶r icke-engelska kÃ¤llsprÃ¥k i vissa format.

source: Added support for go-i18n v2 JSON files.
sv: StÃ¶d fÃ¶r go-i18n v2 JSON-filer har lagts till.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/94?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/94?closed=1>`__.

source: *Released on March 1st 2023.*
sv: *SlÃ¤pptes den 1 mars 2023.*

source: Fixed testsuite error.
sv: Fixat testsuite-fel.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/92?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/92?closed=1>`__.

source: Format string checks now also detects duplicated formats.
sv: FormatstrÃ¤ngskontroller upptÃ¤cker nu Ã¤ven duplicerade format.

source: Improved search performance for some specially formatted strings.
sv: FÃ¶rbÃ¤ttrad sÃ¶kprestanda fÃ¶r vissa specialformaterade strÃ¤ngar.

source: Celery beat is now storing the tasks schedule in the database.
sv: Celery Beat lagrar nu uppgiftschemat i databasen.

source: Added support for IBM Watson Language Translator.
sv: StÃ¶d fÃ¶r IBM Watson Language Translator har lagts till.

source: Dropped support for VCS integration settings deprecated in 4.14.
sv: StÃ¶det fÃ¶r VCS-integrationsinstÃ¤llningar som avvecklats i 4.14 har tagits bort.

source: Added support for Bitbucket Server pull requests.
sv: StÃ¶d fÃ¶r pull-fÃ¶rfrÃ¥gningar frÃ¥n Bitbucket Server har lagts till.

source: Improved conflicts handling in gettext PO files.
sv: FÃ¶rbÃ¤ttrad konflikthantering i gettext PO-filer.

source: Added support for defining strings state when adding via API.
sv: Lagt till stÃ¶d fÃ¶r att definiera strÃ¤ngstatus vid tillÃ¤gg via API.

source: Added support for configuring CORS allowed origins.
sv: Lagt till stÃ¶d fÃ¶r konfigurering av CORS-tillÃ¥tna ursprung.

source: Added plurals support to automatic suggestions.
sv: Lagt till stÃ¶d fÃ¶r pluralformer i automatiska fÃ¶rslag.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/89?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/89?closed=1>`__.
